# IsValidDatumPlaneForProjection Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..IsValidDatumPlaneForProjection Method
AnalyticalModelSketchComponent Class See Also
---
Indicates whether Datum Plane is valid Analytical Projection of Sketch Component.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsValidDatumPlaneForProjection(
	ElementId datumPlaneId
)
```

Visual Basic
---
```text
Public Function IsValidDatumPlaneForProjection ( _
	datumPlaneId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidDatumPlaneForProjection(
	ElementId^ datumPlaneId
)
```

# ### Parameters
datumPlaneId
    Type: Autodesk.Revit.DB..::..ElementId ElementId identifying Datum Plane.
# ### Return Value
True if Datum Plane is valid; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace